function ODE_fnc(du,u,p,t) 
    N,kₛ,η,kf,l₀ = p
    for i = 1:N
        if i == 1
            du[:,i] = (1/η) * dot(Fₛ⁺(u[:,i],u[:,i+1],u[:,N],kₛ,l₀) + Fₛ⁻(u[:,i],u[:,i+1],u[:,N],kₛ,l₀), τ(u[:,i+1],u[:,N]))*τ(u[:,i+1],u[:,N]) + 
            Vₙ(ρ(u[:,i+1],u[:,i]), ρ(u[:,i], u[:,N]), kf)*n(u[:,i+1],u[:,N])
        elseif i == N
            du[:,i] = (1/η) * dot(Fₛ⁺(u[:,i],u[:,1],u[:,i-1],kₛ,l₀) + Fₛ⁻(u[:,i],u[:,1],u[:,i-1],kₛ,l₀), τ(u[:,1],u[:,i-1]))*τ(u[:,1],u[:,i-1]) + 
            Vₙ(ρ(u[:,1],u[:,i]), ρ(u[:,i], u[:,i-1]), kf)*n(u[:,1],u[:,i-1])
        else
            du[:,i] = (1/η) * dot(Fₛ⁺(u[:,i],u[:,i+1],u[:,i-1],kₛ,l₀) + Fₛ⁻(u[:,i],u[:,i+1],u[:,i-1],kₛ,l₀), τ(u[:,i+1],u[:,i-1]))*τ(u[:,i+1],u[:,i-1]) + 
            Vₙ(ρ(u[:,i+1],u[:,i]), ρ(u[:,i], u[:,i-1]), kf)*n(u[:,i+1],u[:,i-1])
        end 
    end
end